In [6]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

#### creating a connection instance

In [7]:
conn = sqlite3.connect('factbook.db')

#### selecting all tables

In [8]:
query = "select * from sqlite_master where type='table'"
pd.read_sql_query(query, conn)

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

#### we see that we have two tables in database

#### selecting first five rows from facts table

In [9]:
facts_query = "select * from facts LIMIT 5"
pd.read_sql_query(facts_query, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

#### minimum population value in facts table

In [10]:
min_pop_query = "select MIN(population) from facts"
pd.read_sql_query(min_pop_query, conn)

   MIN(population)
0                0

#### maximum population value in facts table

In [11]:
max_pop_query = "select MAX(population) from facts"
pd.read_sql_query(max_pop_query, conn)

   MAX(population)
0       7256490011

#### minimum population growth value in facts table

In [12]:
min_pop_growth_query = "select MIN(population_growth) from facts"
pd.read_sql_query(min_pop_growth_query, conn)

   MIN(population_growth)
0                     0.0

#### maximum population growth value in facts table

In [13]:
max_pop_growth_query = "select MAX(population_growth) from facts"
pd.read_sql_query(max_pop_growth_query, conn)

   MAX(population_growth)
0                    4.02

#### country(ies) with minimum population

In [14]:
cont_query_min_pop = "select name from facts where population = 0"
pd.read_sql_query(cont_query_min_pop, conn)

         name
0  Antarctica

#### country(ies) with maximum population

In [15]:
cont_query_max_pop = "select name from facts where population = 7256490011"
pd.read_sql_query(cont_query_max_pop, conn)

    name
0  World

#### Distribution of countries population

In [16]:
def draw_hist(df, n_rows, n_cols):
    fig=plt.figure()
    for i, col in enumerate(df.columns):
        ax=fig.add_subplot(n_rows,n_cols,i+1)
        df[col].hist(bins=10,ax=ax)
        ax.set_title(col +" Distribution")
    fig.tight_layout()  # Improves appearance a bit.
    plt.show()

In [17]:
hist_query = "select population, population_growth, birth_rate, death_rate from facts where population != 0 and population != 7256490011"
df = pd.read_sql_query(hist_query, conn)
draw_hist(df, 2, 2)

#### Which countries have the highest population density?

In [18]:
query_ = "select name from facts where CAST(population as Float)/CAST(area_land as Float) = (select MAX(CAST(population as Float)/CAST(area_land as Float)) from facts)"
pd.read_sql_query(query_, conn)

    name
0  Macau

#### population densities of all countries

In [19]:
query_pop_density = "select name, CAST(population as Float)/CAST(area_land as Float) as population_density from facts"
pd.read_sql_query(query_pop_density, conn)

                                              name  population_density
0                                      Afghanistan           49.927697
1                                          Albania          110.565662
2                                          Algeria           16.602211
3                                          Andorra          182.863248
4                                           Angola           15.741841
5                              Antigua and Barbuda          209.131222
6                                        Argentina           15.870225
7                                          Armenia          108.370812
8                                        Australia            2.961485
9                                          Austria          105.107041
10                                      Azerbaijan          118.369822
11                                    Bahamas, The           32.427273
12                                         Bahrain         1771.859211
13                                      Bangladesh         1297.977606
14                                        Barbados          675.823256
15                                         Belarus           47.263130
16                                         Belgium          374.000033
17                                          Belize           15.231474
18                                           Benin           94.453608
19                                          Bhutan           19.323827
20                                         Bolivia            9.970342
21                          Bosnia and Herzegovina           75.547600
22                                        Botswana            3.851427
23                                          Brazil           24.438429
24                                          Brunei           81.604179
25                                        Bulgaria           66.245361
26                                    Burkina Faso           69.144215
27                                           Burma           86.181357
28                                         Burundi          418.312928
29                                        Cambodia           88.993887
..                                             ...                 ...
231              Falkland Islands (Islas Malvinas)            0.276103
232                                      Gibraltar         4876.333333
233                                       Guernsey          847.179487
234                                         Jersey          838.741379
235                                    Isle of Man          153.050699
236                                     Montserrat           51.382353
237                               Pitcairn Islands            1.021277
238  Saint Helena, Ascension, and Tristan da Cunha           63.893443
239       South Georgia and South Sandwich Islands                 NaN
240                       Turks and Caicos Islands           53.037975
241                                 American Samoa          273.080402
242                                           Guam          297.398897
243                                 Navassa Island                 NaN
244                       Northern Mariana Islands          112.810345
245                                    Puerto Rico          405.677227
246                                 Virgin Islands          299.346821
247                                    Wake Island                 NaN
248  United States Pacific Island Wildlife Refuges                 NaN
249                                     Antarctica            0.000000
250                                     Gaza Strip         5191.819444
251                                Paracel Islands                 NaN
252                                Spratly Islands                 NaN
253                                      West Bank          493.859220
254                                 Western Sahara            2.146113
255                                   Arctic Ocean                 NaN
256                                 Atlantic Ocean                 NaN
257                                   Indian Ocean                 NaN
258                                  Pacific Ocean                 NaN
259                                 Southern Ocean                 NaN
260                                          World                 NaN

[261 rows x 2 columns]

#### some countries have population density = NaN, this could be because of missing value of one or both of population and area_land(as we can see below)

In [24]:
query_nan = 'select name, population, area_land from facts where name = "Wake Island"'
pd.read_sql_query(query_nan, conn)

          name population  area_land
0  Wake Island       None          6

#### Which countries have the highest ratios of water to land?

In [31]:
query_water_to_land_ratio = 'select name as country, CAST(area_water as Float)/CAST(area_land as Float) as water_to_land_ratio from facts ORDER BY water_to_land_ratio DESC'
pd.read_sql_query(query_water_to_land_ratio, conn)

                                           country  water_to_land_ratio
0                   British Indian Ocean Territory           905.666667
1                                   Virgin Islands             4.520231
2                                      Puerto Rico             0.554791
3                                     Bahamas, The             0.386613
4                                    Guinea-Bissau             0.284673
5                                           Malawi             0.259396
6                                      Netherlands             0.225710
7                                           Uganda             0.222922
8                                          Eritrea             0.164356
9                                          Liberia             0.156240
10                                      Bangladesh             0.140509
11                                     Gambia, The             0.116601
12                                          Taiwan             0.115313
13                                         Finland             0.112996
14                                           India             0.105634
15                                          Canada             0.098000
16                                          Sweden             0.097384
17                                        Colombia             0.096476
18                                          Brunei             0.094967
19                                          Guyana             0.092050
20                                French Polynesia             0.088842
21                                       Nicaragua             0.086507
22                                         Burundi             0.083723
23                                            Iran             0.076130
24                                   United States             0.072551
25                                        Tanzania             0.069429
26                                         Vietnam             0.068178
27                                          Rwanda             0.067699
28                                         Estonia             0.067000
29                                          Norway             0.064151
..                                             ...                  ...
231                       Turks and Caicos Islands             0.000000
232                                 American Samoa             0.000000
233                                           Guam             0.000000
234                                 Navassa Island             0.000000
235                       Northern Mariana Islands             0.000000
236                                    Wake Island             0.000000
237                                     Gaza Strip             0.000000
238                                Paracel Islands             0.000000
239                                Spratly Islands             0.000000
240                                 Western Sahara             0.000000
241                                       Ethiopia                  NaN
242                                    New Zealand                  NaN
243                                    South Sudan                  NaN
244                                          Sudan                  NaN
245                        Holy See (Vatican City)                  NaN
246                                 European Union                  NaN
247                                      Greenland                  NaN
248            French Southern and Antarctic Lands                  NaN
249                               Saint Barthelemy                  NaN
250                                   Saint Martin                  NaN
251                                       Akrotiri                  NaN
252                                       Dhekelia                  NaN
253  United States Pacific Island Wildlife Refuges                  NaN
254                                     Antarctica                  NaN
255                                   Arctic Ocean                  NaN
256                                 Atlantic Ocean                  NaN
257                                   Indian Ocean                  NaN
258                                  Pacific Ocean                  NaN
259                                 Southern Ocean                  NaN
260                                          World                  NaN

[261 rows x 2 columns]